; domain
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (domain sailing)
     (:requirements :typing :fluents)
     (:types
          boat person - object
     )
     (:predicates
          (saved ?t - person)
     )
     (:functions
          (x ?b - boat)
          (y ?b - boat)
          (d ?t - person)
     )
     ;; Increment the value in the given counter by one
     (:action go_north_east
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_north_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_est
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 3))
     )
     (:action go_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 3))
     )
     (:action go_south_west
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south_east
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south
          :parameters(?b - boat)
          :precondition (and)
          :effect (and (decrease (y ?b) 2))
     )
     (:action save_person
          :parameters(?b - boat ?t - person)
          :precondition ( and (>= (+ (x ?b) (y ?b)) (d ?t))
               (>= (- (y ?b) (x ?b)) (d ?t))
               (<= (+ (x ?b) (y ?b)) (+ (d ?t) 25))
               (<= (- (y ?b) (x ?b)) (+ (d ?t) 25))
          )
          :effect (and(saved ?t))
     )

)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_13_3)

	(:domain sailing)

	(:objects
		b0 b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 - boat
		p0 p1 p2 - person
	)

  (:init
		(= (x b0) -1)
(= (y b0) 0)
(= (x b1) 6)
(= (y b1) 0)
(= (x b2) 6)
(= (y b2) 0)
(= (x b3) 2)
(= (y b3) 0)
(= (x b4) -9)
(= (y b4) 0)
(= (x b5) 6)
(= (y b5) 0)
(= (x b6) -1)
(= (y b6) 0)
(= (x b7) 5)
(= (y b7) 0)
(= (x b8) 1)
(= (y b8) 0)
(= (x b9) 8)
(= (y b9) 0)
(= (x b10) -3)
(= (y b10) 0)
(= (x b11) -6)
(= (y b11) 0)
(= (x b12) 8)
(= (y b12) 0)

		(= (d p0) 59)
(= (d p1) 86)
(= (d p2) 24)

	)

	(:goal
		(and
			(saved p0)
(saved p1)
(saved p2)
		)
	)
)

; plan
1. (go_north_east b6)
   changed: (x b6) from -1 to 0.5, (y b6) from 0 to 1.5
   goals met: 0 of 3
2. (go_north_east b6)
   changed: (x b6) from 0.5 to 2, (y b6) from 1.5 to 3
   goals met: 0 of 3
3. (go_north_east b6)
   changed: (x b6) from 2 to 3.5, (y b6) from 3 to 4.5
   goals met: 0 of 3
4. (go_north_east b6)
   changed: (x b6) from 3.5 to 5, (y b6) from 4.5 to 6
   goals met: 0 of 3
5. (go_north_east b6)
   changed: (x b6) from 5 to 6.5, (y b6) from 6 to 7.5
   goals met: 0 of 3
6. (go_north_east b6)
   changed: (x b6) from 6.5 to 8, (y b6) from 7.5 to 9
   goals met: 0 of 3
7. (go_north_east b6)
   changed: (x b6) from 8 to 9.5, (y b6) from 9 to 10.5
   goals met: 0 of 3
8. (go_north_east b6)
   changed: (x b6) from 9.5 to 11, (y b6) from 10.5 to 12
   goals met: 0 of 3
9. (go_north_east b6)
   changed: (x b6) from 11 to 12.5, (y b6) from 12 to 13.5
   goals met: 0 of 3
10. (go_north_east b6)
   changed: (x b6) from 12.5 to 14, (y b6) from 13.5 to 15
   goals met: 0 of 3
11. (go_north_east b6)
   changed: (x b6) from 14 to 15.5, (y b6) from 15 to 16.5
   goals met: 0 of 3
12. (go_north_east b6)
   changed: (x b6) from 15.5 to 17, (y b6) from 16.5 to 18
   goals met: 0 of 3
13. (go_north_east b6)
   changed: (x b6) from 17 to 18.5, (y b6) from 18 to 19.5
   goals met: 0 of 3
14. (go_north_east b6)
   changed: (x b6) from 18.5 to 20, (y b6) from 19.5 to 21
   goals met: 0 of 3
15. (go_north_east b6)
   changed: (x b6) from 20 to 21.5, (y b6) from 21 to 22.5
   goals met: 0 of 3
16. (go_north_east b6)
   changed: (x b6) from 21.5 to 23, (y b6) from 22.5 to 24
   goals met: 0 of 3
17. (go_north_west b6)
   changed: (x b6) from 23 to 21.5, (y b6) from 24 to 25.5
   goals met: 0 of 3
18. (go_north_west b6)
   changed: (x b6) from 21.5 to 20, (y b6) from 25.5 to 27
   goals met: 0 of 3
19. (go_north_west b6)
   changed: (x b6) from 20 to 18.5, (y b6) from 27 to 28.5
   goals met: 0 of 3
20. (go_north_west b6)
   changed: (x b6) from 18.5 to 17, (y b6) from 28.5 to 30
   goals met: 0 of 3
21. (go_north_west b6)
   changed: (x b6) from 17 to 15.5, (y b6) from 30 to 31.5
   goals met: 0 of 3
22. (go_north_west b6)
   changed: (x b6) from 15.5 to 14, (y b6) from 31.5 to 33
   goals met: 0 of 3
23. (go_north_west b6)
   changed: (x b6) from 14 to 12.5, (y b6) from 33 to 34.5
   goals met: 0 of 3
24. (go_north_west b6)
   changed: (x b6) from 12.5 to 11, (y b6) from 34.5 to 36
   goals met: 0 of 3
25. (save_person b6 p2)
   added: (saved p2)
   goals met: 1 of 3
26. (go_north_east b6)
   changed: (x b6) from 11 to 12.5, (y b6) from 36 to 37.5
   goals met: 1 of 3
27. (go_north_east b6)
   changed: (x b6) from 12.5 to 14, (y b6) from 37.5 to 39
   goals met: 1 of 3
28. (go_north_east b6)
   changed: (x b6) from 14 to 15.5, (y b6) from 39 to 40.5
   goals met: 1 of 3
29. (go_north_east b6)
   changed: (x b6) from 15.5 to 17, (y b6) from 40.5 to 42
   goals met: 1 of 3
30. (go_north_west b6)
   changed: (x b6) from 17 to 15.5, (y b6) from 42 to 43.5
   goals met: 1 of 3
31. (go_north_west b6)
   changed: (x b6) from 15.5 to 14, (y b6) from 43.5 to 45
   goals met: 1 of 3
32. (go_north_west b6)
   changed: (x b6) from 14 to 12.5, (y b6) from 45 to 46.5
   goals met: 1 of 3
33. (go_north_west b6)
   changed: (x b6) from 12.5 to 11, (y b6) from 46.5 to 48
   goals met: 1 of 3
34. (go_north_west b6)
   changed: (x b6) from 11 to 9.5, (y b6) from 48 to 49.5
   goals met: 1 of 3
35. (go_north_west b6)
   changed: (x b6) from 9.5 to 8, (y b6) from 49.5 to 51
   goals met: 1 of 3
36. (go_north_west b6)
   changed: (x b6) from 8 to 6.5, (y b6) from 51 to 52.5
   goals met: 1 of 3
37. (go_north_west b6)
   changed: (x b6) from 6.5 to 5, (y b6) from 52.5 to 54
   goals met: 1 of 3
38. (go_north_west b6)
   changed: (x b6) from 5 to 3.5, (y b6) from 54 to 55.5
   goals met: 1 of 3
39. (go_north_west b6)
   changed: (x b6) from 3.5 to 2, (y b6) from 55.5 to 57
   goals met: 1 of 3
40. (go_north_west b6)
   changed: (x b6) from 2 to 0.5, (y b6) from 57 to 58.5
   goals met: 1 of 3
41. (go_north_west b6)
   changed: (x b6) from 0.5 to -1, (y b6) from 58.5 to 60
   goals met: 1 of 3
42. (save_person b6 p0)
   added: (saved p0)
   goals met: 2 of 3
43. (go_north_east b6)
   changed: (x b6) from -1 to 0.5, (y b6) from 60 to 61.5
   goals met: 2 of 3
44. (go_north_east b6)
   changed: (x b6) from 0.5 to 2, (y b6) from 61.5 to 63
   goals met: 2 of 3
45. (go_north_east b6)
   changed: (x b6) from 2 to 3.5, (y b6) from 63 to 64.5
   goals met: 2 of 3
46. (go_north_east b6)
   changed: (x b6) from 3.5 to 5, (y b6) from 64.5 to 66
   goals met: 2 of 3
47. (go_north_east b6)
   changed: (x b6) from 5 to 6.5, (y b6) from 66 to 67.5
   goals met: 2 of 3
48. (go_north_east b6)
   changed: (x b6) from 6.5 to 8, (y b6) from 67.5 to 69
   goals met: 2 of 3
49. (go_north_east b6)
   changed: (x b6) from 8 to 9.5, (y b6) from 69 to 70.5
   goals met: 2 of 3
50. (go_north_east b6)
   changed: (x b6) from 9.5 to 11, (y b6) from 70.5 to 72
   goals met: 2 of 3
51. (go_north_east b6)
   changed: (x b6) from 11 to 12.5, (y b6) from 72 to 73.5
   goals met: 2 of 3
52. (go_north_west b6)
   changed: (x b6) from 12.5 to 11, (y b6) from 73.5 to 75
   goals met: 2 of 3
53. (go_north_west b6)
   changed: (x b6) from 11 to 9.5, (y b6) from 75 to 76.5
   goals met: 2 of 3
54. (go_north_west b6)
   changed: (x b6) from 9.5 to 8, (y b6) from 76.5 to 78
   goals met: 2 of 3
55. (go_north_west b6)
   changed: (x b6) from 8 to 6.5, (y b6) from 78 to 79.5
   goals met: 2 of 3
56. (go_north_west b6)
   changed: (x b6) from 6.5 to 5, (y b6) from 79.5 to 81
   goals met: 2 of 3
57. (go_north_west b6)
   changed: (x b6) from 5 to 3.5, (y b6) from 81 to 82.5
   goals met: 2 of 3
58. (go_north_west b6)
   changed: (x b6) from 3.5 to 2, (y b6) from 82.5 to 84
   goals met: 2 of 3
59. (go_north_west b6)
   changed: (x b6) from 2 to 0.5, (y b6) from 84 to 85.5
   goals met: 2 of 3
60. (go_north_west b6)
   changed: (x b6) from 0.5 to -1, (y b6) from 85.5 to 87
   goals met: 2 of 3
61. (save_person b6 p1)
   added: (saved p1)
   goals met: 3 of 3
